In [39]:
import pandas as pd
import os

entry1 = os.listdir('domestic_visitors')

for index, file in enumerate(sorted(entry1)):
    print (file)

df1 = pd.DataFrame()
for index, file in enumerate(sorted(entry1)):
    df = pd.read_csv('domestic_visitors/'+file)
    df1 = pd.concat([df1, df], axis = 0)

domestic_visitors_2016.csv
domestic_visitors_2017.csv
domestic_visitors_2018.csv
domestic_visitors_2019.csv

In [42]:
df1.to_csv('domestic_visitors.csv')

In [43]:
entry2 = os.listdir('foreign_visitors')

for index, file in enumerate(sorted(entry2)):
    print (file)

df2 = pd.DataFrame()
for index, file in enumerate(sorted(entry2)):
    df = pd.read_csv('foreign_visitors/'+file)
    df2 = pd.concat([df2, df], axis = 0)

foreign_visitors_2016.csv
foreign_visitors_2017.csv
foreign_visitors_2018.csv
foreign_visitors_2019.csv

In [45]:
df2.tail(100)

            district        date      month  year visitors
296      Ranga Reddy  01-09-2019  September  2019
297      Ranga Reddy  01-10-2019    October  2019
298      Ranga Reddy  01-11-2019   November  2019
299      Ranga Reddy  01-12-2019   December  2019
300      Sangareddy   01-01-2019    January  2019        0
..               ...         ...        ...   ...      ...
391  Yadadri Bhongir  01-08-2019     August  2019        0
392  Yadadri Bhongir  01-09-2019  September  2019        0
393  Yadadri Bhongir  01-10-2019    October  2019        0
394  Yadadri Bhongir  01-11-2019   November  2019        0
395  Yadadri Bhongir  01-12-2019   December  2019        0

[100 rows x 5 columns]

In [49]:
df2.to_csv('foreign_visitors.csv')

In [50]:
df1['district'].value_counts()

Warangal (Rural)            48
Kamareddy                   48
Jagtial                     48
Ranga Reddy                 48
Bhadradri Kothagudem        48
Adilabad                    48
Wanaparthy                  48
Medchal                     48
Khammam                     48
Mahbubnagar                 48
Nizamabad                   48
Medak                       48
Nirmal                      48
Vikarabad                   48
Suryapet                    48
Warangal (Urban)            48
Nagarkurnool                48
Mahabubabad                 48
Rajanna Sircilla            48
Peddapalli                  48
Jangaon                     48
Yadadri Bhongir             48
Nalgonda                    48
Komaram Bheem Asifabad      48
Mancherial                  48
Jayashankar Bhoopalpally    48
Sangareddy                  48
Hyderabad                   48
Siddipet                    48
Jogulamba Gadwal            48
Karimnagar                  48
Mulugu                      12
Narayanapet                 12
Name: district, dtype: int64

In [51]:
df2.head()

   district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016        2
1  Adilabad  01-02-2016  February  2016        0
2  Adilabad  01-03-2016     March  2016        2
3  Adilabad  01-04-2016     April  2016        0
4  Adilabad  01-05-2016       May  2016        0